
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        7 |           4 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                            |
|:--------:|:-----------------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_policy.infrahouse-ubuntu-pro-permissions`                                                   |
|    🟢    | `aws_iam_role_policy_attachment.infrahouse-ubuntu-pro-permissions`                                   |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_security_group.infrahouse-ubuntu-pro`                         |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro`                          |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_egress_rule.outbound`                      |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.icmp`                         |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.ssh["nat-0346114bc72e2598d"]` |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                   |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                     |
|    🟡    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["noble"]`    |
|    🟡    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["oracular"]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.infrahouse-ubuntu-pro-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "infrahouse-ubuntu-pro-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:SetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-west-1:303467602807:parameter/infrahouse/ubuntu-pro/latest/noble",
              + "arn:aws:ssm:us-west-1:303467602807:parameter/infrahouse/ubuntu-pro/latest/oracular",
            ]
        }
    }

  # aws_iam_policy.infrahouse-ubuntu-pro-permissions will be created
  + resource "aws_iam_policy" "infrahouse-ubuntu-pro-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "infrahouse-ubuntu-pro-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # aws_iam_role_policy_attachment.infrahouse-ubuntu-pro-permissions will be created
  + resource "aws_iam_role_policy_attachment" "infrahouse-ubuntu-pro-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-infrahouse-ubuntu-pro-github"
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0fe52afb929ab485f"
            name    = "actions-runner-20250505203133193000000009"
          ~ version = "7" -> (known after apply)
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0fe52afb929ab485f"
      ~ latest_version                       = 7 -> (known after apply)
        name                                 = "actions-runner-20250505203133193000000009"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJnaCIKLSAibWFrZSIKLSAicHl0aG9uLWlzLXB5dGhvbjMiCiJwdXBwZXQiOgogICJjb2xsZWN0aW9uIjogInB1cHBldDgiCiAgImluc3RhbGwiOiB0cnVlCiAgImluc3RhbGxfdHlwZSI6ICJhaW8iCiAgInBhY2thZ2VfbmFtZSI6ICJwdXBwZXQtYWdlbnQiCiAgInN0YXJ0X3NlcnZpY2UiOiBmYWxzZQogICJ2ZXJzaW9uIjogIjguMTAuMCIKInJ1bmNtZCI6Ci0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwganNvbiIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1zZWNyZXRzbWFuYWdlciIKLSAiaWgtcHVwcGV0ICAtLWVudmlyb25tZW50IGRldmVsb3BtZW50IC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlcwogIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwIgotICJpaC1hd3MgLS12ZXJib3NlIGF1dG9zY2FsaW5nIGNvbXBsZXRlIGJvb3RzdHJhcCIKIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogImRldmVsb3BtZW50IgogICAgInB1cHBldF9yb2xlIjogImdoYV9ydW5uZXIiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImNhbmNlbF9pbnN0YW5jZV9yZWZyZXNoX29uX2Vycm9yXCI6ZmFsc2UsXCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzL3tlbnZpcm9ubWVudH0vbW9kdWxlczp7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXNcIixcInJvb3QtZGlyZWN0b3J5XCI6XCIvb3B0L3B1cHBldC1jb2RlXCJ9fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvaWgtcHVwcGV0Lmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiYm9vdHN0cmFwX2hvb2tuYW1lXCI6XCJib290c3RyYXBcIixcImxhYmVsc1wiOltcImF3c19yZWdpb246dXMtd2VzdC0xXCIsXCJhd3NfYWNjb3VudDozMDM0Njc2MDI4MDdcIixcImluc3RhbGxhdGlvbl9pZDo1MmNjMjNhNS02ZGM0LThhODYtOWQ0MS03Nzg4ODE4MjM2YTVcIixcIm5vYmxlXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1jN0l3cmRcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJwYWNrZXIiCi0gImdoIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInB1cHBldCI6CiAgImNvbGxlY3Rpb24iOiAicHVwcGV0OCIKICAiaW5zdGFsbCI6IHRydWUKICAiaW5zdGFsbF90eXBlIjogImFpbyIKICAicGFja2FnZV9uYW1lIjogInB1cHBldC1hZ2VudCIKICAic3RhcnRfc2VydmljZSI6IGZhbHNlCiAgInZlcnNpb24iOiAiOC4xMC4wIgoicnVuY21kIjoKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBqc29uIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstY29yZSIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzCiAgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCi0gImloLWF3cyAtLXZlcmJvc2UgYXV0b3NjYWxpbmcgY29tcGxldGUgYm9vdHN0cmFwIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogImV4cG9ydCBBV1NfREVGQVVMVF9SRUdJT049dXMtd2VzdC0xIgogICJwYXRoIjogIi9ldGMvcHJvZmlsZS5kL2F3cy5zaCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwtCiAgICBbZGVmYXVsdF0KICAgIHJlZ2lvbj11cy13ZXN0LTEKICAicGF0aCI6ICIvcm9vdC8uYXdzL2NvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDYwMCIKLSAiY29udGVudCI6IHwKICAgICJwdXBwZXRfZW52aXJvbm1lbnQiOiAiZGV2ZWxvcG1lbnQiCiAgICAicHVwcGV0X3JvbGUiOiAiZ2hhX3J1bm5lciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiY2FuY2VsX2luc3RhbmNlX3JlZnJlc2hfb25fZXJyb3JcIjpmYWxzZSxcImRlYnVnXCI6ZmFsc2UsXCJlbnZpcm9ubWVudHBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzXCIsXCJoaWVyYS1jb25maWdcIjpcIi9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbFwiLFwibWFuaWZlc3RcIjpcIi9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJib290c3RyYXBfaG9va25hbWVcIjpcImJvb3RzdHJhcFwiLFwibGFiZWxzXCI6W1wiYXdzX3JlZ2lvbjp1cy13ZXN0LTFcIixcImF3c19hY2NvdW50OjMwMzQ2NzYwMjgwN1wiLFwiaW5zdGFsbGF0aW9uX2lkOjUyY2MyM2E1LTZkYzQtOGE4Ni05ZDQxLTc3ODg4MTgyMzZhNVwiLFwibm9ibGVcIl0sXCJyZWdpc3RyYXRpb25fdG9rZW5fc2VjcmV0X3ByZWZpeFwiOlwiR0gtcmVnLXRva2VuLWM3SXdyZFwifSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
userdata changes:
--- before
+++ after
@@ -78,6 +78,7 @@
 - "devscripts"
 - "infrahouse-puppet-data"
 - "golang"
+- "packer"
 - "gh"
 - "make"
 - "python-is-python3"
EOF userdata changes.
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_security_group.infrahouse-ubuntu-pro will be created
  + resource "aws_security_group" "infrahouse-ubuntu-pro" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "all-house-ubuntu-pro"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + vpc_id                 = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro will be created
  + resource "aws_ssm_parameter" "infrahouse-ubuntu-pro" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Input arguments for the infrahouse-ubuntu-pro packer GitHub Actions job"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:us-west-1:303467602807:key/7434e83c-5df2-4c75-8c98-86992c514e3f"
      + name           = "/infrahouse/ubuntu-pro/args"
      + tags_all       = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["noble"] will be updated in-place
  ~ resource "aws_ssm_parameter" "infrahouse-ubuntu-pro-latest-image" {
        id              = "/infrahouse/ubuntu-pro/latest/noble"
      + key_id          = "arn:aws:kms:us-west-1:303467602807:key/7434e83c-5df2-4c75-8c98-86992c514e3f"
        name            = "/infrahouse/ubuntu-pro/latest/noble"
        tags            = {}
        # (10 unchanged attributes hidden)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["oracular"] will be updated in-place
  ~ resource "aws_ssm_parameter" "infrahouse-ubuntu-pro-latest-image" {
        id              = "/infrahouse/ubuntu-pro/latest/oracular"
      + key_id          = "arn:aws:kms:us-west-1:303467602807:key/7434e83c-5df2-4c75-8c98-86992c514e3f"
        name            = "/infrahouse/ubuntu-pro/latest/oracular"
        tags            = {}
        # (10 unchanged attributes hidden)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_egress_rule.outbound will be created
  + resource "aws_vpc_security_group_egress_rule" "outbound" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Instances in this security group should have access to Internet"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + to_port                = -1
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.ssh["nat-0346114bc72e2598d"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "54.241.214.119/32"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + to_port                = 22
    }

Plan: 7 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDcsICJjaGFuZ2UiOiA0LCAiZGVzdHJveSI6IDB9fQ==
```
</details>